import React from 'react';
import styles from './Blocks.module.scss';

const Blocks = props => {
    return (
        <section>
            <div className="container">
                <div className={styles.titleBlock}>
                    <h2 className="h2">Профессиональная помощь в развитии вашего бизнеса</h2>
                </div>
                <div className={styles.blocks}>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M8.52301 35.6672C6.772 33.9162 5.38303 31.8375 4.43539 29.5497C3.48774 27.2619 3 24.8099 3 22.3336C3 19.8573 3.48774 17.4053 4.43539 15.1175C5.38303 12.8297 6.772 10.751 8.52301 9M35.1902 9C36.9413 10.751 38.3302 12.8297 39.2779 15.1175C40.2255 17.4053 40.7133 19.8573 40.7133 22.3336C40.7133 24.8099 40.2255 27.2619 39.2779 29.5497C38.3302 31.8375 36.9413 33.9162 35.1902 35.6672M14.4481 29.7421C13.4751 28.7693 12.7032 27.6143 12.1765 26.3432C11.6499 25.072 11.3789 23.7096 11.3789 22.3336C11.3789 20.9577 11.6499 19.5952 12.1765 18.3241C12.7032 17.0529 13.4751 15.8979 14.4481 14.9251M29.2651 14.9251C30.2382 15.8979 31.0101 17.0529 31.5367 18.3241C32.0633 19.5952 32.3344 20.9577 32.3344 22.3336C32.3344 23.7096 32.0633 25.072 31.5367 26.3432C31.0101 27.6143 30.2382 28.7693 29.2651 29.7421M23.9518 22.3336C23.9518 22.8893 23.7311 23.4222 23.3381 23.8151C22.9452 24.208 22.4123 24.4288 21.8566 24.4288C21.301 24.4288 20.768 24.208 20.3751 23.8151C19.9822 23.4222 19.7615 22.8893 19.7615 22.3336C19.7615 21.7779 19.9822 21.245 20.3751 20.8521C20.768 20.4592 21.301 20.2385 21.8566 20.2385C22.4123 20.2385 22.9452 20.4592 23.3381 20.8521C23.7311 21.245 23.9518 21.7779 23.9518 22.3336Z"
                                            stroke="#121212" stroke-width="3.42845" stroke-linecap="round"
                                            stroke-linejoin="round"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Удобство онлайн процесса</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Регистрация компании, открытие счета, заключение сделок и
                                другие бизнес-процессы совершаются дистанционно и не требуют
                                вашего присутствия в Индонезии</p>
                        </div>
                    </div>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="37" height="36" viewBox="0 0 37 36" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M3 27V17" stroke="#121212" stroke-width="5" stroke-linecap="round"/>
                                        <path d="M16 34H20" stroke="#121212" stroke-width="4" stroke-linecap="round"/>
                                        <path d="M34 27V17" stroke="#121212" stroke-width="5" stroke-linecap="round"/>
                                        <path d="M33 24V29.5C33 32.2614 30.7614 34.5 28 34.5H16.5" stroke="#121212"/>
                                        <path d="M2.5 16.5C2.5 16.5 2.5 1 18.5 1C34.5 1 34.5 16.5 34.5 16.5"
                                              stroke="#121212" stroke-width="2"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Удобство онлайн процесса</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Регистрация компании, открытие счета, заключение сделок и
                                другие бизнес-процессы совершаются дистанционно и не требуют
                                вашего присутствия в Индонезии</p>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
};

export default Blocks;