import React from 'react';
import styles from './Blocks.module.scss';

const Blocks = props => {
    return (
        <section>
            <div className="container pb-24">
                <div className={styles.titleBlock}>
                    <h2 className="h2">Профессиональная помощь в развитии вашего бизнеса</h2>
                </div>
                <div className={styles.blocks}>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M8.52301 35.6672C6.772 33.9162 5.38303 31.8375 4.43539 29.5497C3.48774 27.2619 3 24.8099 3 22.3336C3 19.8573 3.48774 17.4053 4.43539 15.1175C5.38303 12.8297 6.772 10.751 8.52301 9M35.1902 9C36.9413 10.751 38.3302 12.8297 39.2779 15.1175C40.2255 17.4053 40.7133 19.8573 40.7133 22.3336C40.7133 24.8099 40.2255 27.2619 39.2779 29.5497C38.3302 31.8375 36.9413 33.9162 35.1902 35.6672M14.4481 29.7421C13.4751 28.7693 12.7032 27.6143 12.1765 26.3432C11.6499 25.072 11.3789 23.7096 11.3789 22.3336C11.3789 20.9577 11.6499 19.5952 12.1765 18.3241C12.7032 17.0529 13.4751 15.8979 14.4481 14.9251M29.2651 14.9251C30.2382 15.8979 31.0101 17.0529 31.5367 18.3241C32.0633 19.5952 32.3344 20.9577 32.3344 22.3336C32.3344 23.7096 32.0633 25.072 31.5367 26.3432C31.0101 27.6143 30.2382 28.7693 29.2651 29.7421M23.9518 22.3336C23.9518 22.8893 23.7311 23.4222 23.3381 23.8151C22.9452 24.208 22.4123 24.4288 21.8566 24.4288C21.301 24.4288 20.768 24.208 20.3751 23.8151C19.9822 23.4222 19.7615 22.8893 19.7615 22.3336C19.7615 21.7779 19.9822 21.245 20.3751 20.8521C20.768 20.4592 21.301 20.2385 21.8566 20.2385C22.4123 20.2385 22.9452 20.4592 23.3381 20.8521C23.7311 21.245 23.9518 21.7779 23.9518 22.3336Z"
                                            stroke="#121212" strokeWidth="3.42845" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Удобство онлайн процесса</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Регистрация компании, открытие счета, заключение сделок и
                                другие бизнес-процессы совершаются дистанционно и не требуют
                                вашего присутствия в Индонезии</p>
                        </div>
                    </div>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="37" height="36" viewBox="0 0 37 36" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M3 27V17" stroke="#121212" strokeWidth="5" strokeLinecap="round"/>
                                        <path d="M16 34H20" stroke="#121212" strokeWidth="4" strokeLinecap="round"/>
                                        <path d="M34 27V17" stroke="#121212" strokeWidth="5" strokeLinecap="round"/>
                                        <path d="M33 24V29.5C33 32.2614 30.7614 34.5 28 34.5H16.5" stroke="#121212"/>
                                        <path d="M2.5 16.5C2.5 16.5 2.5 1 18.5 1C34.5 1 34.5 16.5 34.5 16.5"
                                              stroke="#121212" strokeWidth="2"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Экспертная поддержка</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Наши специалисты окажут профессиональную поддержку вашему проекту на всех этапах
                                его существования – от формирования ТЗ до решения операционных задач</p>
                        </div>
                    </div>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M3.66666 12.8332C3.66666 11.8607 4.05296 10.9281 4.7406 10.2404C5.42823 9.55281 6.36086 9.1665 7.33332 9.1665H36.6667C37.6391 9.1665 38.5717 9.55281 39.2594 10.2404C39.947 10.9281 40.3333 11.8607 40.3333 12.8332V31.1665C40.3333 32.139 39.947 33.0716 39.2594 33.7592C38.5717 34.4469 37.6391 34.8332 36.6667 34.8332H7.33332C6.36086 34.8332 5.42823 34.4469 4.7406 33.7592C4.05296 33.0716 3.66666 32.139 3.66666 31.1665V12.8332Z"
                                            stroke="#121212" strokeWidth="3" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                        <path
                                            d="M22 27.5C25.0376 27.5 27.5 25.0376 27.5 22C27.5 18.9624 25.0376 16.5 22 16.5C18.9625 16.5 16.5 18.9624 16.5 22C16.5 25.0376 18.9625 27.5 22 27.5Z"
                                            stroke="#121212" strokeWidth="3" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                        <path
                                            d="M3.66666 16.4998C5.61158 16.4998 7.47684 15.7272 8.85211 14.352C10.2274 12.9767 11 11.1114 11 9.1665M33 34.8332C33 32.8883 33.7726 31.023 35.1479 29.6477C36.5231 28.2725 38.3884 27.4998 40.3333 27.4998"
                                            stroke="#121212" strokeWidth="3" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Прозрачные тарифы</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Вы получите детальный расчет всех предоставляемых услуг, а также расценки о
                                наиболее востребованных дополнительных услугах и обслуживанию на год вперед</p>
                        </div>
                    </div>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M8.52301 35.6672C6.772 33.9162 5.38303 31.8375 4.43539 29.5497C3.48774 27.2619 3 24.8099 3 22.3336C3 19.8573 3.48774 17.4053 4.43539 15.1175C5.38303 12.8297 6.772 10.751 8.52301 9M35.1902 9C36.9413 10.751 38.3302 12.8297 39.2779 15.1175C40.2255 17.4053 40.7133 19.8573 40.7133 22.3336C40.7133 24.8099 40.2255 27.2619 39.2779 29.5497C38.3302 31.8375 36.9413 33.9162 35.1902 35.6672M14.4481 29.7421C13.4751 28.7693 12.7032 27.6143 12.1765 26.3432C11.6499 25.072 11.3789 23.7096 11.3789 22.3336C11.3789 20.9577 11.6499 19.5952 12.1765 18.3241C12.7032 17.0529 13.4751 15.8979 14.4481 14.9251M29.2651 14.9251C30.2382 15.8979 31.0101 17.0529 31.5367 18.3241C32.0633 19.5952 32.3344 20.9577 32.3344 22.3336C32.3344 23.7096 32.0633 25.072 31.5367 26.3432C31.0101 27.6143 30.2382 28.7693 29.2651 29.7421M23.9518 22.3336C23.9518 22.8893 23.7311 23.4222 23.3381 23.8151C22.9452 24.208 22.4123 24.4288 21.8566 24.4288C21.301 24.4288 20.768 24.208 20.3751 23.8151C19.9822 23.4222 19.7615 22.8893 19.7615 22.3336C19.7615 21.7779 19.9822 21.245 20.3751 20.8521C20.768 20.4592 21.301 20.2385 21.8566 20.2385C22.4123 20.2385 22.9452 20.4592 23.3381 20.8521C23.7311 21.245 23.9518 21.7779 23.9518 22.3336Z"
                                            stroke="#121212" strokeWidth="3.42845" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Удобство онлайн процесса</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Регистрация компании, открытие счета, заключение сделок и
                                другие бизнес-процессы совершаются дистанционно и не требуют
                                вашего присутствия в Индонезии</p>
                        </div>
                    </div>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="37" height="36" viewBox="0 0 37 36" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M3 27V17" stroke="#121212" strokeWidth="5" strokeLinecap="round"/>
                                        <path d="M16 34H20" stroke="#121212" strokeWidth="4" strokeLinecap="round"/>
                                        <path d="M34 27V17" stroke="#121212" strokeWidth="5" strokeLinecap="round"/>
                                        <path d="M33 24V29.5C33 32.2614 30.7614 34.5 28 34.5H16.5" stroke="#121212"/>
                                        <path d="M2.5 16.5C2.5 16.5 2.5 1 18.5 1C34.5 1 34.5 16.5 34.5 16.5"
                                              stroke="#121212" strokeWidth="2"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Экспертная поддержка</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Наши специалисты окажут профессиональную поддержку вашему проекту на всех этапах
                                его существования – от формирования ТЗ до решения операционных задач</p>
                        </div>
                    </div>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M3.66666 12.8332C3.66666 11.8607 4.05296 10.9281 4.7406 10.2404C5.42823 9.55281 6.36086 9.1665 7.33332 9.1665H36.6667C37.6391 9.1665 38.5717 9.55281 39.2594 10.2404C39.947 10.9281 40.3333 11.8607 40.3333 12.8332V31.1665C40.3333 32.139 39.947 33.0716 39.2594 33.7592C38.5717 34.4469 37.6391 34.8332 36.6667 34.8332H7.33332C6.36086 34.8332 5.42823 34.4469 4.7406 33.7592C4.05296 33.0716 3.66666 32.139 3.66666 31.1665V12.8332Z"
                                            stroke="#121212" strokeWidth="3" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                        <path
                                            d="M22 27.5C25.0376 27.5 27.5 25.0376 27.5 22C27.5 18.9624 25.0376 16.5 22 16.5C18.9625 16.5 16.5 18.9624 16.5 22C16.5 25.0376 18.9625 27.5 22 27.5Z"
                                            stroke="#121212" strokeWidth="3" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                        <path
                                            d="M3.66666 16.4998C5.61158 16.4998 7.47684 15.7272 8.85211 14.352C10.2274 12.9767 11 11.1114 11 9.1665M33 34.8332C33 32.8883 33.7726 31.023 35.1479 29.6477C36.5231 28.2725 38.3884 27.4998 40.3333 27.4998"
                                            stroke="#121212" strokeWidth="3" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Прозрачные тарифы</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Вы получите детальный расчет всех предоставляемых услуг, а также расценки о
                                наиболее востребованных дополнительных услугах и обслуживанию на год вперед</p>
                        </div>
                    </div>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="37" height="36" viewBox="0 0 37 36" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path d="M3 27V17" stroke="#121212" strokeWidth="5" strokeLinecap="round"/>
                                        <path d="M16 34H20" stroke="#121212" strokeWidth="4" strokeLinecap="round"/>
                                        <path d="M34 27V17" stroke="#121212" strokeWidth="5" strokeLinecap="round"/>
                                        <path d="M33 24V29.5C33 32.2614 30.7614 34.5 28 34.5H16.5" stroke="#121212"/>
                                        <path d="M2.5 16.5C2.5 16.5 2.5 1 18.5 1C34.5 1 34.5 16.5 34.5 16.5"
                                              stroke="#121212" strokeWidth="2"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Экспертная поддержка</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Наши специалисты окажут профессиональную поддержку вашему проекту на всех этапах
                                его существования – от формирования ТЗ до решения операционных задач</p>
                        </div>
                    </div>
                    <div className={styles.block}>
                        <div className={styles.titleBlock}>
                            <div className={styles.icon}>
                                <i>
                                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M3.66666 12.8332C3.66666 11.8607 4.05296 10.9281 4.7406 10.2404C5.42823 9.55281 6.36086 9.1665 7.33332 9.1665H36.6667C37.6391 9.1665 38.5717 9.55281 39.2594 10.2404C39.947 10.9281 40.3333 11.8607 40.3333 12.8332V31.1665C40.3333 32.139 39.947 33.0716 39.2594 33.7592C38.5717 34.4469 37.6391 34.8332 36.6667 34.8332H7.33332C6.36086 34.8332 5.42823 34.4469 4.7406 33.7592C4.05296 33.0716 3.66666 32.139 3.66666 31.1665V12.8332Z"
                                            stroke="#121212" strokeWidth="3" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                        <path
                                            d="M22 27.5C25.0376 27.5 27.5 25.0376 27.5 22C27.5 18.9624 25.0376 16.5 22 16.5C18.9625 16.5 16.5 18.9624 16.5 22C16.5 25.0376 18.9625 27.5 22 27.5Z"
                                            stroke="#121212" strokeWidth="3" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                        <path
                                            d="M3.66666 16.4998C5.61158 16.4998 7.47684 15.7272 8.85211 14.352C10.2274 12.9767 11 11.1114 11 9.1665M33 34.8332C33 32.8883 33.7726 31.023 35.1479 29.6477C36.5231 28.2725 38.3884 27.4998 40.3333 27.4998"
                                            stroke="#121212" strokeWidth="3" strokeLinecap="round"
                                            strokeLinejoin="round"/>
                                    </svg>
                                </i>
                            </div>
                            <h3>Прозрачные тарифы</h3>
                        </div>
                        <div className={styles.text}>
                            <p>Вы получите детальный расчет всех предоставляемых услуг, а также расценки о
                                наиболее востребованных дополнительных услугах и обслуживанию на год вперед</p>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
};

export default Blocks;